#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/sh-testing/terraform-git/runs/run-bXo6naeHDFyweWN2

Waiting for the plan to start...

Terraform v1.2.9
on linux_amd64
Initializing plugins and modules...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-00fb70d2702ae91f9]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-04e65122f85fc43fd]
module.website_s3_bucket.aws_s3_bucket.s3_bucket: Refreshing state... [id=terraform-demo-20221003-prod]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-02824f0b579c4c07f]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-048aff98ff8de63f6]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0660b6deec2e7cfcb]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-0100d866c39be386e]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-05ea62a782744d6b5]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-07667cda92f65ffbe]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-089c15331fa44a2ee]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-07f5eb7470538150a]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0dde4f4bc1662fd6e]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-089c15331fa44a2ee1080289494]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0fa3c211f4bdcc946]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0c59b0e4b693f490a]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0d5497424f3568834]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0cad701747f53764d]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-09cb0a3783a0be3b0]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-0cbb474936ec91c82]
module.ec2_instances.aws_instance.this[0]: Refreshing state... [id=i-05fef79700540f57a]
module.ec2_instances.aws_instance.this[1]: Refreshing state... [id=i-0d49c48cb7cefaf30]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-07f5eb7470538150a1080289494]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-0100d866c39be386e1080289494]
module.website_s3_bucket.aws_s3_bucket_policy.s3_bucket: Refreshing state... [id=terraform-demo-20221003-prod]
module.website_s3_bucket.aws_s3_bucket_website_configuration.s3_bucket: Refreshing state... [id=terraform-demo-20221003-prod]
module.website_s3_bucket.aws_s3_bucket_acl.s3_bucket: Refreshing state... [id=terraform-demo-20221003-prod,public-read]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.website_s3_bucket.aws_s3_bucket.s3_bucket must be replaced
-/+ resource "aws_s3_bucket" "s3_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      ~ arn                         = "arn:aws:s3:::terraform-demo-20221003-prod" -> (known after apply)
      ~ bucket                      = "terraform-demo-20221003-prod" -> "terraform-demo-20221225-prod" # forces replacement
      ~ bucket_domain_name          = "terraform-demo-20221003-prod.s3.amazonaws.com" -> (known after apply)
      ~ bucket_regional_domain_name = "terraform-demo-20221003-prod.s3.us-west-2.amazonaws.com" -> (known after apply)
      ~ hosted_zone_id              = "Z3BJ6K6RIION7M" -> (known after apply)
      ~ id                          = "terraform-demo-20221003-prod" -> (known after apply)
      ~ object_lock_enabled         = false -> (known after apply)
      ~ policy                      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:GetObject"
                      - Effect    = "Allow"
                      - Principal = "*"
                      - Resource  = [
                          - "arn:aws:s3:::terraform-demo-20221003-prod",
                          - "arn:aws:s3:::terraform-demo-20221003-prod/*",
                        ]
                      - Sid       = "PublicReadGetObject"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      ~ region                      = "us-west-2" -> (known after apply)
      ~ request_payer               = "BucketOwner" -> (known after apply)
        tags                        = {
            "Environment" = "prod"
            "Terraform"   = "true"
        }
      ~ website_domain              = "s3-website-us-west-2.amazonaws.com" -> (known after apply)
      ~ website_endpoint            = "terraform-demo-20221003-prod.s3-website-us-west-2.amazonaws.com" -> (known after apply)
        # (2 unchanged attributes hidden)

      + cors_rule {
          + allowed_headers = (known after apply)
          + allowed_methods = (known after apply)
          + allowed_origins = (known after apply)
          + expose_headers  = (known after apply)
          + max_age_seconds = (known after apply)
        }

      - grant {
          - permissions = [
              - "READ",
            ] -> null
          - type        = "Group" -> null
          - uri         = "http://acs.amazonaws.com/groups/global/AllUsers" -> null
        }
      - grant {
          - id          = "7af36568517fa1408836e4fe5d0df8a393e21f7e35d11a95c08be3d28ee346cb" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
        }
      + grant {
          + id          = (known after apply)
          + permissions = (known after apply)
          + type        = (known after apply)
          + uri         = (known after apply)
        }

      + lifecycle_rule {
          + abort_incomplete_multipart_upload_days = (known after apply)
          + enabled                                = (known after apply)
          + id                                     = (known after apply)
          + prefix                                 = (known after apply)
          + tags                                   = (known after apply)

          + expiration {
              + date                         = (known after apply)
              + days                         = (known after apply)
              + expired_object_delete_marker = (known after apply)
            }

          + noncurrent_version_expiration {
              + days = (known after apply)
            }

          + noncurrent_version_transition {
              + days          = (known after apply)
              + storage_class = (known after apply)
            }

          + transition {
              + date          = (known after apply)
              + days          = (known after apply)
              + storage_class = (known after apply)
            }
        }

      + logging {
          + target_bucket = (known after apply)
          + target_prefix = (known after apply)
        }

      + object_lock_configuration {
          + object_lock_enabled = (known after apply)

          + rule {
              + default_retention {
                  + days  = (known after apply)
                  + mode  = (known after apply)
                  + years = (known after apply)
                }
            }
        }

      + replication_configuration {
          + role = (known after apply)

          + rules {
              + delete_marker_replication_status = (known after apply)
              + id                               = (known after apply)
              + prefix                           = (known after apply)
              + priority                         = (known after apply)
              + status                           = (known after apply)

              + destination {
                  + account_id         = (known after apply)
                  + bucket             = (known after apply)
                  + replica_kms_key_id = (known after apply)
                  + storage_class      = (known after apply)

                  + access_control_translation {
                      + owner = (known after apply)
                    }

                  + metrics {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }

                  + replication_time {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }
                }

              + filter {
                  + prefix = (known after apply)
                  + tags   = (known after apply)
                }

              + source_selection_criteria {
                  + sse_kms_encrypted_objects {
                      + enabled = (known after apply)
                    }
                }
            }
        }

      + server_side_encryption_configuration {
          + rule {
              + bucket_key_enabled = (known after apply)

              + apply_server_side_encryption_by_default {
                  + kms_master_key_id = (known after apply)
                  + sse_algorithm     = (known after apply)
                }
            }
        }

      ~ versioning {
          ~ enabled    = false -> (known after apply)
          ~ mfa_delete = false -> (known after apply)
        }

      ~ website {
          ~ error_document           = "error.html" -> (known after apply)
          ~ index_document           = "index.html" -> (known after apply)
          + redirect_all_requests_to = (known after apply)
          + routing_rules            = (known after apply)
        }
    }

  # module.website_s3_bucket.aws_s3_bucket_acl.s3_bucket must be replaced
-/+ resource "aws_s3_bucket_acl" "s3_bucket" {
      ~ bucket = "terraform-demo-20221003-prod" -> (known after apply) # forces replacement
      ~ id     = "terraform-demo-20221003-prod,public-read" -> (known after apply)
        # (1 unchanged attribute hidden)

      ~ access_control_policy {
          - grant {
              - permission = "READ" -> null

              - grantee {
                  - type = "Group" -> null
                  - uri  = "http://acs.amazonaws.com/groups/global/AllUsers" -> null
                }
            }
          - grant {
              - permission = "FULL_CONTROL" -> null

              - grantee {
                  - display_name = "stefan.hogle" -> null
                  - id           = "7af36568517fa1408836e4fe5d0df8a393e21f7e35d11a95c08be3d28ee346cb" -> null
                  - type         = "CanonicalUser" -> null
                }
            }
          + grant {
              + permission = (known after apply)

              + grantee {
                  + display_name  = (known after apply)
                  + email_address = (known after apply)
                  + id            = (known after apply)
                  + type          = (known after apply)
                  + uri           = (known after apply)
                }
            }

          ~ owner {
              ~ display_name = "stefan.hogle" -> (known after apply)
              ~ id           = "7af36568517fa1408836e4fe5d0df8a393e21f7e35d11a95c08be3d28ee346cb" -> (known after apply)
            }
        }
    }

  # module.website_s3_bucket.aws_s3_bucket_policy.s3_bucket must be replaced
-/+ resource "aws_s3_bucket_policy" "s3_bucket" {
      ~ bucket = "terraform-demo-20221003-prod" -> (known after apply) # forces replacement
      ~ id     = "terraform-demo-20221003-prod" -> (known after apply)
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:GetObject"
                      - Effect    = "Allow"
                      - Principal = "*"
                      - Resource  = [
                          - "arn:aws:s3:::terraform-demo-20221003-prod",
                          - "arn:aws:s3:::terraform-demo-20221003-prod/*",
                        ]
                      - Sid       = "PublicReadGetObject"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
    }

  # module.website_s3_bucket.aws_s3_bucket_website_configuration.s3_bucket must be replaced
-/+ resource "aws_s3_bucket_website_configuration" "s3_bucket" {
      ~ bucket           = "terraform-demo-20221003-prod" -> (known after apply) # forces replacement
      ~ id               = "terraform-demo-20221003-prod" -> (known after apply)
      + routing_rules    = (known after apply)
      ~ website_domain   = "s3-website-us-west-2.amazonaws.com" -> (known after apply)
      ~ website_endpoint = "terraform-demo-20221003-prod.s3-website-us-west-2.amazonaws.com" -> (known after apply)

      + routing_rule {
          + condition {
              + http_error_code_returned_equals = (known after apply)
              + key_prefix_equals               = (known after apply)
            }

          + redirect {
              + host_name               = (known after apply)
              + http_redirect_code      = (known after apply)
              + protocol                = (known after apply)
              + replace_key_prefix_with = (known after apply)
              + replace_key_with        = (known after apply)
            }
        }

        # (2 unchanged blocks hidden)
    }

Plan: 4 to add, 0 to change, 4 to destroy.

Changes to Outputs:
  ~ website_bucket_arn    = "arn:aws:s3:::terraform-demo-20221003-prod" -> (known after apply)
  ~ website_bucket_domain = "s3-website-us-west-2.amazonaws.com" -> (known after apply)
  ~ website_bucket_name   = "terraform-demo-20221003-prod" -> (known after apply)
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "AWS_SECRET_ACCESS_KEY"
│ but a value was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-bXo6naeHDFyweWN2/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "AWS_ACCESS_KEY_ID" but a
│ value was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-bXo6naeHDFyweWN2/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

```

</details>

*Pushed by: @shogle-dev, Action: `pull_request`*